[
    {
      "_id": "RS101",
      "name": "Rocket Propulsion",
      "number": "RS4550",
      "startDate": "2023-01-10",
      "endDate": "2023-05-15",
      "department": "D123",
      "credits": 4,
      "image": "/images/course1.jpeg",
      "description": "This course provides an in-depth study of the fundamentals of rocket propulsion, covering topics such as propulsion theory, engine types, fuel chemistry, and the practical applications of rocket technology. Designed for students with a strong background in physics and engineering, the course includes both theoretical instruction and hands-on laboratory work"
    },
    {
      "_id": "RS102",
      "name": "Aerodynamics",
      "number": "RS4560",
      "startDate": "2023-01-10",
      "endDate": "2023-05-15",
      "department": "D123",
      "credits": 3,
      "image": "/images/course2.jpeg",
      "description": "This course offers a comprehensive exploration of aerodynamics, focusing on the principles and applications of airflow and its effects on flying objects. Topics include fluid dynamics, airfoil design, lift and drag forces, and the aerodynamic considerations in aircraft design. The course blends theoretical learning with practical applications, suitable for students pursuing a career in aeronautics or astronautics engineering."
    },
    {
      "_id": "RS103",
      "name": "Spacecraft Design",
      "number": "RS4570",
      "startDate": "2023-01-10",
      "endDate": "2023-05-15",
      "department": "D123",
      "credits": 4,
      "image": "/images/course3.jpeg",
      "description": "This course delves into the principles and practices of spacecraft design, offering students a detailed understanding of the engineering and technology behind spacecraft systems. Key topics include spacecraft structure, propulsion, power systems, thermal control, and payload integration. Emphasizing both theoretical concepts and practical skills, the course prepares students for careers in the space industry, with a focus on innovative design and problem-solving in the context of current and future space missions"
    },
    {
      "_id": "RS104",
      "name": "Corruption, Integrity, and Accountability",
      "number": "CRIM1500",
      "startDate": "2023-01-10",
      "endDate": "2023-05-15",
      "department": "D134",
      "credits": 3,
      "image": "/images/course4.jpeg",
      "description": "CIA is a course that dives deep into the corruption of governments aroun the world. It takes a look at importnt theroies and predictions about the corruption of the world."
    },
    {
      "_id": "RS105",
      "name": "Web Development",
      "number": "Cs4550",
      "startDate": "2023-01-10",
      "endDate": "2023-05-15",
      "department": "D134",
      "credits": 3,
      "image": "/images/course5.jpeg",
      "description": "Web development is a course that allows students to gain an understanding of HTML, React.js, CSS and Node.js. Students will be able to create different websites with the help of interesting web development concepts."
    },
    {
      "_id": "RS106",
      "name": "Computer Systems",
      "number": "CS3650",
      "startDate": "2023-01-10",
      "endDate": "2023-05-15",
      "department": "D134",
      "credits": 3,
      "image": "/images/course6.jpeg",
      "description": "Computer Systems is a class that allows students to learn how to code in assembly and the C compiler."
    },
    {
      "_id": "RS107",
      "name": "Linear Algebra",
      "number": "MATH2331",
      "startDate": "2023-01-10",
      "endDate": "2023-05-15",
      "department": "Math",
      "credits": 3,
      "image": "/images/course7.webp",
      "description": "This course offers students the ability to learn how to do algebra linealy. Students will learn about the matrixs, rref, and other concepts realted to linear algebra.",
      "author": "654f9ec2ea7ead465908d1e3"
    }
]